import React from "react";
import { SectionTitle } from "@/shared/ui/section-title";
import { Swiper, SwiperSlide } from "swiper/react";
import "swiper/css";

type Feedback = {
  name: string;
  text: string;
};

export const Testimonials: React.FC = () => {
  const feedbacks: Feedback[] = [
    {
      name: "Elia",
      text: "Дякую 🥰 Відчуття просто неймовірні тому що переживала, щоб встигнути купити квиток і УРААА ЦЕ ВДАЛОСЯ!😁🔥 Тому що для мене це дуже важливо так як я хочу розвиватися і більше дізнатися і вдосконалювати свої знання, я в перше буду на такій масштабній конференції nails moment сподіваюсь буде дуже круто і багато цікавого але я як побачила, що буде така конкуренція в Польщі сперва не повірила думала справді розводняк 😅але ні, я побачила на сторінці angelina_nail_say що це офіційно так, що буде такий захід і відразу ж написала 😁❤️ І дякую велике за терпіння адміністрації сторінки за терпіння 😅❤️",
    },
    {
      name: "Mariia",
      text: "Збулася моя маленька мрія (познайомитися з Машою:)) завдяки Вам. Закохалася в Юлю Зварич. Супер мотиватор. Все було по ділу, дуже інформативно. Чудові люди. Нові знайомі. Ще раз дякую і до нової зустрічі 😘❤️🤗😍",
    },
    {
      name: "Mariia",
      text: "Я насправді, дуже задоволена😍із нетерпінням чекаю на цей день ❤я такий отримала заряд позитивної енергії, прагнення йти в перед і не зупинятися ні в чому ❤❤🔥вдячна кожному, хто був причетний в організації цієї конференції ❤",
    },
    {
      name: "Kasia",
      text: "Супер) даже не думала идти или нет на вторую конференцию, как увидела - сразу поняла что надо идти😁 Прошлая конференция была супер! Всё очень понравилось, было невероятно интересно) Вышла очень замотивированная и с очень положительными эмоциями 🥰 Подарки тоже огонь! Спасибо большое вам за такую возможность 🤗😍 С нетерпением жду следующую конференцию 💗",
    },
    {
      name: "Svetik",
      text: "Дякую Вам🫶я навіть не можу підібрати слова ,які в мене відчуття 😍я після конференції почула себе на пару сходинок вище ,багато в чому оцінила себе зі сторони в кращий  напрямок, в якому ,ще більше хочу розвиватися ,тому те ,що знову йду на Nail Moment переповнює  натхнення не тільки розвиватися ,а й жити 😍так ,як з понеділка йду на операцію не дуже легку, за яку дуже переживаю ,щоб все пройшло нормально без наслідків .тому буду боротися за життя ради конференції 🫶😍є стимул такий !!!.дякую ще раз вам всім за такі круті конференції  🫶🫶🫶🫶",
    },
    {
      name: "Diana",
      text: "Тепер я розумію настільки круті та важливі такі події ❤️  🔥 їх точно потрібно відвідувати раз в рік то 💯",
    },
    {
      name: "Liza",
      text: "Вот приблизительно такие ощущения у меня от предстоящей конференции. Возможность провести целый день в окружении ЛУЧШИХ мастеров своего дела, научиться чему-то новому, приобрести новые навыки. Это на самом деле придает уверенности в себе. Это что-то невероятное! Спасибо вам за такую возможность!",
    },
  ];

  return (
    <section className="px-4 py-14 flex flex-col">
      <SectionTitle className="w-full px-4 md:mb-6">Відгуки</SectionTitle>
      <Swiper
        spaceBetween={30}
        grabCursor={true}
        slidesPerView={1.25}
        breakpoints={{
          1024: {
            slidesPerView: 2.5,
            centeredSlides: true,
            initialSlide: 1,
          },
        }}
        className="w-full"
      >
        {feedbacks.map((feedback, index) => (
          <SwiperSlide key={index}>
            <div className="bg-primary p-5 rounded-xl md:px-10 md:pt-10 md:pb-16">
              <div className="flex items-center gap-2.5 md:gap-4">
                <div className="flex flex-col">
                  <h3 className="text-primary-foreground text-sm font-bold uppercase md:text-lg">
                    {feedback.name}
                  </h3>
                </div>
                <svg
                  className="hidden ml-auto md:block"
                  width="42"
                  height="33"
                  viewBox="0 0 42 33"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M42 10.5339C42 24.7966 34.4494 33 22.746 33L22.746 22.1864L23.8786 22.1864C31.2404 22.1864 34.7325 20.1356 35.6764 15.9407C34.9213 16.1271 34.0718 16.2203 33.2224 16.2203C27.937 16.2203 24.3505 12.7712 24.3505 8.11017C24.3505 3.44915 27.9371 -1.22942e-06 32.7506 -8.08611e-07C38.5079 -3.05292e-07 42 3.44915 42 10.5339ZM19.2539 10.5339C19.2539 24.7966 11.7034 33 0 33L9.45352e-07 22.1864L1.13257 22.1864C8.49436 22.1864 11.9865 20.1356 12.9303 15.9407C12.1753 16.1271 11.3258 16.2203 10.4764 16.2203C5.19098 16.2203 1.60449 12.7712 1.60449 8.11016C1.60449 3.44915 5.19097 -3.21795e-06 10.0045 -2.79714e-06C15.7618 -2.29382e-06 19.2539 3.44915 19.2539 10.5339Z"
                    fill="#FE018A"
                  />
                </svg>
              </div>
              <p className="mt-2.5 text-primary-foreground text-sm font-light opacity-80 md:text-lg md:mt-4">
                {feedback.text}
              </p>
            </div>
          </SwiperSlide>
        ))}
      </Swiper>
    </section>
  );
};
