const text = [
  {
    title: "Кращі спікери",
    description: "Незабутній досвід для nail майстрів та власників салонів",
  },
  {
    title: "Челенджі",
    description:
      "Випробуй свої навички та виграй призи у захоплюючих конкурсах",
  },
  {
    title: "Шопінг та виставка",
    description:
      "Зустрінь свої улюблені бренди особисто. Ексклюзивні пропозиції та останні новинки",
  },
];
export const List = () => {
  return (
    <ul className="flex flex-col gap-6 text-center list-none">
      {text.map((item) => (
        <li className="flex gap-4 text-start" key={item.title}>
          <span>
            <svg
              width="29"
              height="30"
              viewBox="0 0 29 30"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                fillRule="evenodd"
                clipRule="evenodd"
                d="M11.5313 1.59192C11.5313 1.03964 11.979 0.591919 12.5313 0.591919L15.8477 0.591919C16.3999 0.591919 16.8477 1.03963 16.8477 1.59192V9.08606L22.2167 3.717C22.6072 3.32647 23.2404 3.32647 23.6309 3.717L25.976 6.06204C26.3665 6.45257 26.3665 7.08573 25.976 7.47626L21.3285 12.1238L28 12.1238C28.5523 12.1238 29 12.5715 29 13.1238V16.4402C29 16.9924 28.5523 17.4402 28 17.4402H20.6451L26.0138 22.8089C26.4044 23.1994 26.4044 23.8326 26.0138 24.2231L23.6688 26.5681C23.2783 26.9587 22.6451 26.9587 22.2546 26.5681L16.8477 21.1612V28.5919C16.8477 29.1442 16.3999 29.5919 15.8477 29.5919H12.5313C11.979 29.5919 11.5313 29.1442 11.5313 28.5919V21.921L6.8841 26.5681C6.49357 26.9587 5.86041 26.9587 5.46988 26.5681L3.12484 24.2231C2.73431 23.8326 2.73431 23.1994 3.12484 22.8089L8.49356 17.4402H1C0.447715 17.4402 0 16.9924 0 16.4402V13.1238C0 12.5715 0.447715 12.1238 1 12.1238L7.8102 12.1238L3.16269 7.47626C2.77217 7.08573 2.77217 6.45257 3.16269 6.06204L5.50774 3.717C5.89826 3.32647 6.53143 3.32647 6.92195 3.717L11.5313 8.32631V1.59192Z"
                fill="#FE018A"
              />
            </svg>
          </span>
          <span>
            <h4 className="text-base uppercase font-travels font-bold text-primary-foreground">
              {item.title}
            </h4>
            <span className="text-base font-asteriks text-primary-foreground-muted leading-6">
              {item.description}
            </span>
          </span>
        </li>
      ))}
    </ul>
  );
};
